src/cf/Catalogs/ПолныеРоли.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ПолныеРоли</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.РолиИсполнителей</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДополнительныйОбъектАдресации</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ОбъектыАдресацииЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойОбъектАдресации</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ОбъектыАдресацииЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/ПолныеРоли/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияДокументооборот.УстановитьДополнительноеСвойствоПредыдущиеЗначенияРеквизитов(ЭтотОбъект);
	
	ДополнительныеСвойства.Вставить(
		"ПараметрыОбновленияДанныхКэширующихОбъектов",
		Справочники.ПолныеРоли.ЗначенияПараметровОбновленияДанныхКэширующихОбъектов(ЭтотОбъект));
	
	Если ДополнительныеСвойства.ЭтоНовый Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыВладельца = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Владелец, "ПометкаУдаления,
		|ИспользуетсяБезОбъектовАдресации, ИспользуетсяСОбъектамиАдресации,
		|ТипыОсновногоОбъектаАдресации, ТипыДополнительногоОбъектаАдресации");
	
	ОбъектыАдресацииОбязательны = Не РеквизитыВладельца.ИспользуетсяБезОбъектовАдресации;
	
	ОбъектыАдресацииУказаны =
		ОсновнойОбъектАдресации <> Неопределено
		Или ДополнительныйОбъектАдресации <> Неопределено;
		
	Если РеквизитыВладельца.ИспользуетсяСОбъектамиАдресации
			И ЗначениеЗаполнено(РеквизитыВладельца.ТипыОсновногоОбъектаАдресации) Тогда
		
		ТипыОсновногоОбъектаАдресации = РеквизитыВладельца.ТипыОсновногоОбъектаАдресации.ТипЗначения.Типы();
		Если РеквизитыВладельца.ИспользуетсяБезОбъектовАдресации Тогда
			ТипыОсновногоОбъектаАдресации.Добавить(Тип("Неопределено"));
		КонецЕсли;
	Иначе
		ТипыОсновногоОбъектаАдресации = Новый Массив;
		ТипыОсновногоОбъектаАдресации.Добавить(Тип("Неопределено"));
	КонецЕсли;
	
	Если РеквизитыВладельца.ИспользуетсяСОбъектамиАдресации
			И ЗначениеЗаполнено(РеквизитыВладельца.ТипыДополнительногоОбъектаАдресации) Тогда
		
		ТипыДополнительногоОбъектаАдресации = РеквизитыВладельца.ТипыДополнительногоОбъектаАдресации.ТипЗначения.Типы();
		Если РеквизитыВладельца.ИспользуетсяБезОбъектовАдресации Тогда
			ТипыДополнительногоОбъектаАдресации.Добавить(Тип("Неопределено"));
		КонецЕсли;
	Иначе
		ТипыДополнительногоОбъектаАдресации = Новый Массив;
		ТипыДополнительногоОбъектаАдресации.Добавить(Тип("Неопределено"));
	КонецЕсли;
	
	ПометкаУдаления =
		РеквизитыВладельца.ПометкаУдаления
			Или (ОбъектыАдресацииОбязательны И Не ОбъектыАдресацииУказаны)
			Или (ТипыОсновногоОбъектаАдресации.Найти(ТипЗнч(ОсновнойОбъектАдресации)) = Неопределено)
			Или (ТипыДополнительногоОбъектаАдресации.Найти(ТипЗнч(ДополнительныйОбъектАдресации)) = Неопределено);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Справочники.ПолныеРоли.ОбновитьДанныеКэширующихОбъектов(
		ЭтотОбъект, ДополнительныеСвойства.ПараметрыОбновленияДанныхКэширующихОбъектов);
	
	Справочники.ФактическиеИсполнители.УстановитьСнятьПометкуУдаленияФактическогоИсполнителя(ЭтотОбъект);
	
	Если ДополнительныеСвойства.ПредыдущиеЗначенияРеквизитов.ПометкаУдаления <> ПометкаУдаления Тогда
		РегистрыСведений.СоставСубъектовПравДоступа.ОбновитьПометкиУдаленияПоПолнойРоли(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
